zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
/***************************************************************************//**
* \file cy_capsense_sensing_v2.c
* \version 10.0.0
*
* \brief
* This file contains the source of functions common for different sensing
* methods.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#include <stdlib.h>
#include <stddef.h>
#include "cy_gpio.h"
#include "cy_sysclk.h"

#include "cycfg_capsense_defines.h"
#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing_v2.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_csx_v2.h"
#include "cy_capsense_csd_v2.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_selftest.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    #include "cy_csd.h"
#endif

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2))


/*******************************************************************************
* Constants
*******************************************************************************/
#define CY_CAPSENSE_AUTOTUNE_CALIBRATION_RESOLUTION             (12u)
#define CY_CAPSENSE_AUTOTUNE_CALIBRATION_FREQ_KHZ               (1500u)
#define CY_CAPSENSE_CSD_SNS_FREQ_KHZ_MAX                        (6000u)
#define CY_CAPSENSE_CSD_AUTOTUNE_CAL_UNITS                      (1000u)
#define CY_CAPSENSE_AUTOTUNE_CP_MAX                             (69000Lu)

#define CY_CAPSENSE_EXT_CAP_DISCHARGE_TIME                      (1u)

#define CY_CAPSENSE_VREF_GAIN_MAX                               (32u)
#define CY_CAPSENSE_VREF_VDDA_MIN_DIFF                          (600u)
#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    #define CY_CAPSENSE_VREF_SRSS_MV                            (1200u)
#else
    #define CY_CAPSENSE_VREF_SRSS_MV                            (800u)
#endif
#define CY_CAPSENSE_VREF_PASS_MV                                (1200u)

#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    #define CY_CAPSENSE_VREF_RANGE_0                            (4700u)
    #define CY_CAPSENSE_VREF_RANGE_1                            (3200u)
    #define CY_CAPSENSE_VREF_RANGE_2                            (2600u)
    #define CY_CAPSENSE_VREF_VALUE_0                            (2743u)
    #define CY_CAPSENSE_VREF_VALUE_1                            (2021u)
    #define CY_CAPSENSE_VREF_VALUE_2                            (1477u)
    #define CY_CAPSENSE_VREF_VALUE_MIN                          (1200u)
#else
    #define CY_CAPSENSE_VREF_RANGE_0                            (2750u)
    #define CY_CAPSENSE_VREF_RANGE_1                            (2200u)
    #define CY_CAPSENSE_VREF_VALUE_0                            (2133u)
    #define CY_CAPSENSE_VREF_VALUE_1                            (1600u)
    #define CY_CAPSENSE_VREF_VALUE_MIN_SRSS                     (1164u)
    #define CY_CAPSENSE_VREF_VALUE_MIN_PASS                     (1200u)
#endif

#if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_USE_CAPTURE)
    const cy_stc_csd_config_t cy_capsense_csdCfg = CY_CAPSENSE_CSD_CONFIG_DEFAULT;
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_SetBusyFlags
****************************************************************************//**
*
* Sets BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application program.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetBusyFlags(cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->status |= CY_CAPSENSE_BUSY;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ClrBusyFlags
****************************************************************************//**
*
* Clears BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application program.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ClrBusyFlags(cy_stc_capsense_context_t * context)
{
    /* Clear busy flag */
    context->ptrCommonContext->status &= (uint32_t)(~((uint32_t)CY_CAPSENSE_BUSY));
    context->ptrActiveScanSns->scanScope = CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS;

    /* Mark completion of scan cycle */
    context->ptrCommonContext->scanCounter++;

