zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_ScanWidget_V2
****************************************************************************//**
*
* Configures the specified widget and initiates scanning of all the sensors
* in the widget if no scan is in progress.
*
* This function initiates scan only for the first sensor in the widget and then
* exits the function. The scan for the remaining sensors in the widget is
* initiated in the interrupt service routine (part of middleware) triggered
* at the end of each scan completion. Hence, status of the current scan
* should be checked using the Cy_CapSense_IsBusy() and wait until all scans
* in the current widget are finished prior to starting the next scan or
* initializing another widget.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the scan initiation operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - Scanning is successfully started.
* - CY_CAPSENSE_STATUS_INVALID_STATE - The previous scan is not completed and
*                                      the CSD HW block is busy.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The widget is invalid or if the specified widget is
*                                      disabled.
* - CY_CAPSENSE_STATUS_BAD_CONFIG    - The function does not suppose to be
*                                      called with the current CAPSENSE&trade;
*                                      configuration.
*
********************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanWidget_V2(uint32_t widgetId, cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    cy_capsense_status_t scanStatus = CY_CAPSENSE_STATUS_SUCCESS;

    if (CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(context))
    {
        /* Previous widget is being scanned. Return error. */
        scanStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    }
    else
    {
        if ((context->ptrActiveScanSns->widgetIndex != (uint8_t)widgetId) ||
            (ptrActive->connectedSnsState != CY_CAPSENSE_SNS_DISCONNECTED) ||
            (ptrActive->currentSenseMethod != context->ptrWdConfig[widgetId].senseMethod))
        {
            scanStatus = Cy_CapSense_SetupWidget(widgetId, context);
        }
        if (CY_CAPSENSE_STATUS_SUCCESS == scanStatus)
        {
           scanStatus = Cy_CapSense_Scan(context);
        }
    }
    return scanStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetupWidgetExt
****************************************************************************//**
*
* Performs extended initialization for the specified widget and also performs
* initialization required for a specific sensor in the widget.
*
* This function requires using the Cy_CapSense_ScanExt() function to
* initiate a scan.
*
* This function does the same as Cy_CapSense_SetupWidget() and also
* does the following tasks:
* 1. Connects the specified sensor of the widget.
* 2. Configures the CSD HW block to perform a scan of the specified sensor.
*
* Once this function is called to initialize a widget and a sensor, the
* Cy_CapSense_ScanExt() function is called to scan the sensor.
*
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status.
*
* Calling this function directly from the application program is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time or pipeline scanning, for example).
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the
* sensor ID within a specified widget can be found in the cycfg_capsense.h
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget setting up operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The widget is invalid or if the specified widget is
*                          disabled.
* - CY_CAPSENSE_STATUS_INVALID_STATE - The previous scanning is not completed and
*                          the CSD HW block is busy.
*
**********************************************************************************/
cy_capsense_status_t Cy_CapSense_SetupWidgetExt(
                uint32_t widgetId,
                uint32_t sensorId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t widgetStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(context))
    {
        /* Previous widget is being scanned. Return error. */
        widgetStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    }
    /*
     * Check whether widget id is valid, specified widget is enabled and widget did not
     * detect any fault conditions. If all conditions are met,
     * set widgetStatus as good, if not, set widgetStatus as bad.
     */
    else if ((context->ptrCommonConfig->numWd > widgetId) &&
        (0u != Cy_CapSense_IsWidgetEnabled(widgetId, context)))
    {
        if (context->ptrWdConfig[widgetId].numSns > sensorId)
        {
            /* Check widget sensing method and call corresponding setup function */
            switch (context->ptrWdConfig[widgetId].senseMethod)
            {
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                    case CY_CAPSENSE_CSD_GROUP:
                        Cy_CapSense_CSDSetupWidgetExt(widgetId, sensorId, context);
                        break;
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    case CY_CAPSENSE_CSX_GROUP:
                        Cy_CapSense_CSXSetupWidgetExt(widgetId, sensorId, context);
                        break;
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                default:
                    /* No other sensing methods */
                    break;
            }

            widgetStatus = CY_CAPSENSE_STATUS_SUCCESS;
        }
    }
    else
    {
        /* Do nothing */
    }

