zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_InternalPreCalculation
****************************************************************************//**
*
* Calculate different internal parameters, register values in advance to
* speed up execution time.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns status of operation:
* - Zero        - Indicates successful initialization.
* - Non-zero    - One or more errors occurred in the initialization process.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InternalPreCalculation(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t initStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t wdgtIndex;
    uint32_t temp;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if ((context->ptrCommonConfig->portCmodPadNum == context->ptrCommonConfig->portCmodNum) &&
            (context->ptrCommonConfig->pinCmodPad == context->ptrCommonConfig->pinCmod))
        {
            context->ptrInternalContext->csdCmodConnection = (uint8_t)CY_CAPSENSE_CMODPAD_E;
        }
        else if ((context->ptrCommonConfig->portCshPadNum == context->ptrCommonConfig->portCmodNum) &&
                 (context->ptrCommonConfig->pinCshPad == context->ptrCommonConfig->pinCmod))
        {
            context->ptrInternalContext->csdCmodConnection = (uint8_t)CY_CAPSENSE_CTANKPAD_E;
        }
        else if ((context->ptrCommonConfig->portShieldPadNum == context->ptrCommonConfig->portCmodNum) &&
                 (context->ptrCommonConfig->pinShieldPad == context->ptrCommonConfig->pinCmod))
        {
            context->ptrInternalContext->csdCmodConnection = (uint8_t)CY_CAPSENSE_CSHIELDPAD_E;
        }
        else if ((context->ptrCommonConfig->portVrefExtPadNum == context->ptrCommonConfig->portCmodNum) &&
                 (context->ptrCommonConfig->pinVrefExtPad == context->ptrCommonConfig->pinCmod))
        {
            context->ptrInternalContext->csdCmodConnection = (uint8_t)CY_CAPSENSE_VREFEXTPAD_E;
        }
        else
        {
            context->ptrInternalContext->csdCmodConnection = (uint8_t)CY_CAPSENSE_CMODPAD_E;
            initStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
        }

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN)
            /* Csh Capacitor Placement */
            if ((context->ptrCommonConfig->portCmodPadNum == context->ptrCommonConfig->portCshNum) &&
                (context->ptrCommonConfig->pinCmodPad == context->ptrCommonConfig->pinCsh))
            {
                context->ptrInternalContext->csdCshConnection = (uint8_t)CY_CAPSENSE_CMODPAD_E;
            }
            else if ((context->ptrCommonConfig->portCshPadNum == context->ptrCommonConfig->portCshNum) &&
                     (context->ptrCommonConfig->pinCshPad == context->ptrCommonConfig->pinCsh))
            {
                context->ptrInternalContext->csdCshConnection = (uint8_t)CY_CAPSENSE_CTANKPAD_E;
            }
            else if ((context->ptrCommonConfig->portShieldPadNum == context->ptrCommonConfig->portCshNum) &&
                     (context->ptrCommonConfig->pinShieldPad == context->ptrCommonConfig->pinCsh))
            {
                context->ptrInternalContext->csdCshConnection = (uint8_t)CY_CAPSENSE_CSHIELDPAD_E;
            }
            else if ((context->ptrCommonConfig->portVrefExtPadNum == context->ptrCommonConfig->portCshNum) &&
                     (context->ptrCommonConfig->pinVrefExtPad == context->ptrCommonConfig->pinCsh))
            {
                context->ptrInternalContext->csdCshConnection = (uint8_t)CY_CAPSENSE_VREFEXTPAD_E;
            }
            else
            {
                context->ptrInternalContext->csdCshConnection = (uint8_t)CY_CAPSENSE_CTANKPAD_E;
                initStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
            }
        #else
            context->ptrInternalContext->csdCshConnection = 0u;
        #endif

        /* Switch CSD Comparator Selection */
        switch (context->ptrInternalContext->csdCmodConnection)
        {
            case (uint8_t)CY_CAPSENSE_CMODPAD_E:
                context->ptrInternalContext->csdRegSwCmpPSel = CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_CLOSE;
                break;
            case (uint8_t)CY_CAPSENSE_CSHIELDPAD_E:
                context->ptrInternalContext->csdRegSwCmpPSel = CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFPS_STATIC_CLOSE;
                break;
            default:
                context->ptrInternalContext->csdRegSwCmpPSel = CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_CLOSE;
                break;
        }
        context->ptrInternalContext->csdRegSwCmpNSel = CY_CAPSENSE_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE;

        /* Defines the drive mode of pins depending on the Inactive sensor connection setting */
        (void)Cy_CapSense_SetInactiveElectrodeState(context->ptrCommonConfig->csdInactiveSnsConnection,
                                                     CY_CAPSENSE_CSD_GROUP, context);

        /* Prepares CONFIG register value */
        context->ptrInternalContext->csdRegConfig = 0u;
        /* Iref Source */
        #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
            if (CY_CAPSENSE_IREF_PASS == context->ptrCommonConfig->ssIrefSource)
            {
                context->ptrInternalContext->csdRegConfig |= CY_CAPSENSE_CSD_CONFIG_IREF_SEL_MSK;
            }
        #endif

        /* Filter Delay */
        temp = context->ptrCommonConfig->periClkHz / context->ptrCommonContext->modCsdClk;
        if (temp > CY_CAPSENSE_MOD_CSD_CLK_24000000_HZ)
        {
            context->ptrInternalContext->csdRegConfig |= CY_CAPSENSE_CSD_CONFIG_FILTER_DELAY_48MHZ;
        }
        else if (temp > CY_CAPSENSE_MOD_CSD_CLK_12000000_HZ)
        {
            context->ptrInternalContext->csdRegConfig |= CY_CAPSENSE_CSD_CONFIG_FILTER_DELAY_24MHZ;
        }
        else
        {
            context->ptrInternalContext->csdRegConfig |= CY_CAPSENSE_CSD_CONFIG_FILTER_DELAY_12MHZ;
        }
        /* Shield Delay */
        context->ptrInternalContext->csdRegConfig |= (((uint32_t)context->ptrCommonConfig->csdShieldDelay) << CY_CAPSENSE_CSD_CONFIG_SHIELD_DELAY_POS);
        /* Sense Enable */
        context->ptrInternalContext->csdRegConfig |= CSD_CONFIG_SENSE_EN_Msk;
        /* Power On */
        context->ptrInternalContext->csdRegConfig |= CSD_CONFIG_ENABLE_Msk;

        context->ptrInternalContext->csdRegSwHsPSelCmodInit = 0u;
        context->ptrInternalContext->csdRegSwHsPSelCtankInit = 0u;
        context->ptrInternalContext->csdRegSwHsPSelScan = 0u;

        switch (context->ptrInternalContext->csdCmodConnection)
        {
            case (uint8_t)CY_CAPSENSE_CMODPAD_E:
                context->ptrInternalContext->csdRegSwHsPSelCmodInit = CY_CAPSENSE_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE;
                break;
            case (uint8_t)CY_CAPSENSE_CSHIELDPAD_E:
                context->ptrInternalContext->csdRegSwHsPSelCmodInit = CY_CAPSENSE_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE;
                break;
            default:
                context->ptrInternalContext->csdRegSwHsPSelCmodInit = CY_CAPSENSE_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE;
                break;
        }

