zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
        /* IDACs Polarities */
        if (CY_CAPSENSE_IDAC_SINKING == context->ptrCommonConfig->csdChargeTransfer)
        {
            context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_POLARITY_VDDA_SNK << CY_CAPSENSE_CSD_IDACA_POLARITY_POS);
            context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_POLARITY_VDDA_SNK << CY_CAPSENSE_CSD_IDACB_POLARITY_POS);
        }
        else
        {
            context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_POLARITY_VSSA_SRC << CY_CAPSENSE_CSD_IDACA_POLARITY_POS);
            context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_POLARITY_VSSA_SRC << CY_CAPSENSE_CSD_IDACB_POLARITY_POS);
        }
        /* IDACs Balancing Mode */
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_BALL_MODE_FULL << CY_CAPSENSE_CSD_IDACA_BALL_MODE_POS);
        context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_BALL_MODE_FULL << CY_CAPSENSE_CSD_IDACB_BALL_MODE_POS);
        /* Legs Config */
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_LEG1_MODE_CSD << CY_CAPSENSE_CSD_IDACA_LEG1_MODE_POS);
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_LEG2_MODE_CSD << CY_CAPSENSE_CSD_IDACA_LEG2_MODE_POS);
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_LEG1_EN_MSK);

        context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_LEG1_MODE_CSD_STATIC << CY_CAPSENSE_CSD_IDACB_LEG1_MODE_POS);
        context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_LEG2_MODE_CSD_STATIC << CY_CAPSENSE_CSD_IDACB_LEG2_MODE_POS);

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
            context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_LEG1_EN_MSK);
        #endif

        /* IO Control Selection */
        if (CY_CAPSENSE_IDAC_SINKING == context->ptrCommonConfig->csdChargeTransfer)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 |
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2 |
                                                            CY_CAPSENSE_CSD_TX_OUT_EN_PHI1_DELAY |
                                                            CY_CAPSENSE_CSD_TX_AMUXB_EN_PHI2_DELAY |
                                                            CY_CAPSENSE_CSD_TX_OUT_MSK |
                                                            CY_CAPSENSE_CSD_TX_N_OUT_STATIC_CLOSE);
            #else
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 |
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2 |
                                                            CY_CAPSENSE_CSD_TX_N_OUT_STATIC_CLOSE);
            #endif
        }
        else
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 |
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2 |
                                                            CY_CAPSENSE_CSD_TX_OUT_EN_PHI1_DELAY |
                                                            CY_CAPSENSE_CSD_TX_AMUXB_EN_PHI2_DELAY);
            #else
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 |
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2);
            #endif
        }

        if (context->ptrCommonConfig->csdVref == 0u)
        {
            /* Get the recommended Vref voltage value if the Custom Vref option is not used */
            temp = Cy_CapSense_GetVrefAutoMv(context);
        }
        else
        {
            /* Initialize the Temp variable with the user defined Vref voltage */
            temp = (uint32_t)context->ptrCommonConfig->csdVref;
            if (temp > (uint32_t)((uint32_t)context->ptrCommonConfig->vdda - CY_CAPSENSE_VREF_VDDA_MIN_DIFF))
            {
                temp = (uint32_t)context->ptrCommonConfig->vdda - CY_CAPSENSE_VREF_VDDA_MIN_DIFF;
            }
        }

        /* Calculate the VrefHigh Gain for the desired Vref voltage when PASS is used as the Vref source. */
        temp = Cy_CapSense_GetVrefHighGain(temp, context);
        /* Calculates the VrefHigh voltage, when SRSS is used as the Vref source. */
        context->ptrInternalContext->csdVrefVoltageMv = (uint16_t)Cy_CapSense_GetVrefHighMv(temp, context);
        context->ptrInternalContext->csdVrefGain = (uint8_t)temp;

        /* RefGen initialization */
        context->ptrInternalContext->csdRegRefgen  = (CSD_REFGEN_REFGEN_EN_Msk |
                                                      CSD_REFGEN_RES_EN_Msk |
                                                      (uint32_t)(temp << CSD_REFGEN_GAIN_Pos));
        #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
            if (CY_CAPSENSE_LOW_VOLTAGE_LIMIT > context->ptrCommonConfig->vdda)
            {
                context->ptrInternalContext->csdRegRefgen  = (CSD_REFGEN_REFGEN_EN_Msk |
                                                              CSD_REFGEN_BYPASS_Msk);
            }
        #endif

        /* SW_RefGen_SEL initialization */
        context->ptrInternalContext->csdRegSwRefGenSel = CSD_SW_REFGEN_SEL_SW_SGR_Msk;
        #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
            if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
            {
                context->ptrInternalContext->csdRegSwRefGenSel = CSD_SW_REFGEN_SEL_SW_SGRP_Msk;
            }
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
            context->ptrInternalContext->csdRegSwRefGenSel |= CSD_SW_REFGEN_SEL_SW_IAIB_Msk;
        #endif

    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    /* Initialize maxRawCount for all widgets */
    for (wdgtIndex = context->ptrCommonConfig->numWd; wdgtIndex-- > 0u;)
    {
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[wdgtIndex].senseMethod)
            {
                context->ptrWdContext[wdgtIndex].maxRawCount =
                                (uint16_t)(((uint32_t)0x01u << context->ptrWdContext[wdgtIndex].resolution) - 1u);
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[wdgtIndex].senseMethod)
            {
                context->ptrWdContext[wdgtIndex].maxRawCount = (uint16_t)(context->ptrWdContext[wdgtIndex].resolution *
                                (context->ptrWdContext[wdgtIndex].snsClk - CY_CAPSENSE_CSX_DEADBAND_CYCLES_NUMBER));
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        /* CSX Initialization */
        /* Defines the inactive electrode mode depending on the Inactive sensor connection setting */
        (void)Cy_CapSense_SetInactiveElectrodeState(context->ptrCommonConfig->csxInactiveSnsConnection,
                                                     CY_CAPSENSE_CSX_GROUP, context);

        context->ptrInternalContext->csxRegSwRefGenSel = CSD_SW_REFGEN_SEL_SW_SGR_Msk;
        #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
            if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
            {
                context->ptrInternalContext->csxRegSwRefGenSel = CSD_SW_REFGEN_SEL_SW_SGRP_Msk;
            }
        #endif

