zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
    Cy_CapSense_InitializeSourceSenseClk(context);

    /* Set all IO states to the default state */
    Cy_CapSense_SetIOsInDesiredState(CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, 0u, CY_CAPSENSE_HSIOM_SEL_GPIO, context);
    Cy_CapSense_SetSpecificIOsInDefaultState(context);

    /* The CSD HW block is initialized in the Setup Widget functions based on widget sensing method */
    (void)Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_UNDEFINED_GROUP, context);

    return initStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetPinState_V2
****************************************************************************//**
*
* The internal function to set the state (drive mode and HSIOM state) of the GPIO used
* by a sensor.
*
* See the Cy_CapSense_SetPinState() description for details.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param sensorElement
* Specifies the ID of the sensor element within the widget to change
* its pin state.
* * For the CSD widgets use the sensor ID. A macro for the
*   sensor ID within a specified widget can be found in the cycfg_capsense.h
*   file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
* * For the CSX widgets use either Rx ID or Tx ID.
*   The first Rx in a widget corresponds to sensorElement = 0; the second
*   Rx in a widget corresponds to sensorElement = 1, and so on.
*   The last Tx in a widget corresponds to sensorElement = (RxNum + TxNum - 1).
*   A macro for the Rx ID or Tx ID can be found in the cycfg_capsense.h
*   file defined as CY_CAPSENSE_<WIDGET_NAME>_<TX/RX><TX/RX_NUMBER>_ID.
*
* \param state
* Specifies the state of the sensor to be set:
* 1. CY_CAPSENSE_GROUND - The pin is connected to the ground.
* 2. CY_CAPSENSE_HIGHZ  - The drive mode of the pin is set to High-Z
*                         Analog.
* 3. CY_CAPSENSE_SHIELD - The shield signal is routed to the pin
*                         (available only if CSD sensing method with
*                         shield electrode is enabled).
* 4. CY_CAPSENSE_SENSOR - The pin is connected to the scanning bus
*                         (available only if CSD sensing method is enabled).
* 5. CY_CAPSENSE_TX_PIN - The Tx signal is routed to the sensor
*                         (available only if CSX sensing method is enabled).
* 6. CY_CAPSENSE_RX_PIN - The pin is connected to the scanning bus
*                         (available only if CSX sensing method is enabled).
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the operation status:
* - CY_CAPSENSE_STATUS_SUCCESS   - Indicates the successful electrode setting.
* - CY_CAPSENSE_STATUS_BAD_PARAM - 1) widgetID or sensorElement are not valid;
*                      2) the CSD sensing method is disabled for desired
*                         CY_CAPSENSE_SHIELD or CY_CAPSENSE_SENSOR states;
*                      3) the CSX sensing method is disabled for desired
*                         CY_CAPSENSE_TX_PIN or CY_CAPSENSE_RX_PIN states.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SetPinState_V2(
                uint32_t widgetId,
                uint32_t sensorElement,
                uint32_t state,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t connState = CY_CAPSENSE_STATUS_BAD_PARAM;
    uint32_t eltdNum;
    uint32_t eltdIndex;
    uint32_t interruptState;
    cy_stc_capsense_pin_config_t const * ioPtr;
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_electrode_config_t const * ptrSnsEltdConfig;

    if (context->ptrCommonConfig->numWd > widgetId)
    {
        /* Get number of electrodes within the widget */
        eltdNum = (uint32_t)ptrWdCfg->numCols + ptrWdCfg->numRows;

        if (eltdNum > sensorElement)
        {
            /* Set the pointer to the specified sensor element configuration structure */
            ptrSnsEltdConfig = &ptrWdCfg->ptrEltdConfig[sensorElement];
            /* Get number of electrode's pins and a pointer to the electrode's pin structure */
            eltdNum = ptrSnsEltdConfig->numPins;
            ioPtr = ptrSnsEltdConfig->ptrPin;
            /* Loop through all pins of the specified sensor electrode */
            for (eltdIndex = 0u; eltdIndex < eltdNum; eltdIndex++)
            {
                /* Reset HSIOM and PC registers */
                interruptState = Cy_SysLib_EnterCriticalSection();
                Cy_GPIO_SetHSIOM(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, CY_CAPSENSE_HSIOM_SEL_GPIO);
                Cy_SysLib_ExitCriticalSection(interruptState);

                switch (state)
                {
                    case CY_CAPSENSE_GROUND:
                        interruptState = Cy_SysLib_EnterCriticalSection();
                        Cy_GPIO_SetDrivemode(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF);
                        Cy_GPIO_Clr(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber);
                        Cy_SysLib_ExitCriticalSection(interruptState);

                        connState = CY_CAPSENSE_STATUS_SUCCESS;
                        break;

                    case CY_CAPSENSE_HIGHZ:
                        interruptState = Cy_SysLib_EnterCriticalSection();
                        Cy_GPIO_SetDrivemode(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, CY_CAPSENSE_DM_GPIO_ANALOG);
                        Cy_GPIO_Clr(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber);
                        Cy_SysLib_ExitCriticalSection(interruptState);

                        connState = CY_CAPSENSE_STATUS_SUCCESS;
                        break;

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                        case CY_CAPSENSE_SENSOR:
                            /* Enable sensor */
                            Cy_CapSense_CSDConnectSns(ioPtr, context);
                            connState = CY_CAPSENSE_STATUS_SUCCESS;
                            break;

                    case CY_CAPSENSE_SHIELD:
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                            Cy_CapSense_SsConfigPinRegisters(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber,
                                    CY_CAPSENSE_DM_SHIELD, CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD);
                            connState = CY_CAPSENSE_STATUS_SUCCESS;
                        #endif
                        break;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                        case CY_CAPSENSE_TX_PIN:
                            Cy_CapSense_SsConfigPinRegisters(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber,
                                    CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD);
                            connState = CY_CAPSENSE_STATUS_SUCCESS;
                            break;

