zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
                        case CY_CAPSENSE_RX_PIN:
                            Cy_CapSense_SsConfigPinRegisters(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber,
                                    CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
                            connState = CY_CAPSENSE_STATUS_SUCCESS;
                            break;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                    default:
                        /* No other sensor states */
                        break;
                }

                ioPtr++;
            }
        }
    }
    return connState;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SwitchSensingMode
****************************************************************************//**
*
* This function changes the mode for case when both CSD and CSX widgets are
* scanned.
*
* Once the function is called it performs the following tasks:
* 1. Releasing the CSD HW block by existing sensing method.
* 2. Configuring corresponding external capacitors and sensor pins into
*    default states.
* 3. Setting new mode.
* 4. Configuring HW to the new sensing mode.
*
* \param mode
* Specifies the scan mode:
* - CY_CAPSENSE_CSD_GROUP
* - CY_CAPSENSE_CSX_GROUP
* - CY_CAPSENSE_UNDEFINED_GROUP
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the operation status:
* - CY_CAPSENSE_SUCCESS_E   - Indicates the successful mode switching or
*                             the sensing HW block is in the same mode as desired.
* - CY_CAPSENSE_HW_BUSY_E   - The sensing HW block is busy with previous operation.
* - CY_CAPSENSE_HW_LOCKED_E - The sensing HW block is captured by another middleware.
*
*******************************************************************************/
cy_en_capsense_return_status_t Cy_CapSense_SwitchSensingMode(uint8_t mode, cy_stc_capsense_context_t * context)
{
    cy_en_capsense_return_status_t switchStatus = CY_CAPSENSE_SUCCESS_E;

    if (context->ptrActiveScanSns->currentSenseMethod != mode)
    {
        /* Check the CSD HW lock status */
        if (CY_CSD_CAPSENSE_KEY == Cy_CSD_GetLockStatus(context->ptrCommonConfig->ptrCsdBase,
                                                       context->ptrCommonConfig->ptrCsdContext))
        {
            if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
            {
                /* The requested mode differs from the current one. Disable the current mode. */
                switch (context->ptrActiveScanSns->currentSenseMethod)
                {
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                        case CY_CAPSENSE_CSD_GROUP:
                            Cy_CapSense_CSDDisableMode(context);
                            break;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                        case CY_CAPSENSE_CSX_GROUP:
                            Cy_CapSense_CSXDisableMode(context);
                            break;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
                        case CY_CAPSENSE_BIST_GROUP:
                                Cy_CapSense_BistDisableMode(context);
                            break;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */
                    default:
                        /* No action for other sensing methods */
                        break;
                }

                /* Enable the specified mode */
                switch (mode)
                {
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                        case CY_CAPSENSE_CSD_GROUP:
                            Cy_CapSense_CSDInitialize(context);
                            break;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                        case CY_CAPSENSE_CSX_GROUP:
                            Cy_CapSense_CSXInitialize(context);
                            break;
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN)
                        case CY_CAPSENSE_BIST_GROUP:
                            Cy_CapSense_BistInitialize(context);
                            break;
                    #endif

                    default:
                        /* No action for other sensing methods */
                        break;
                }

                if (CY_CAPSENSE_UNDEFINED_GROUP == context->ptrActiveScanSns->currentSenseMethod)
                {
                    /* The time interval is required for settling analog part of the HW block. */
                    Cy_SysLib_DelayUs(CY_CAPSENSE_ANALOG_SETTLING_TIME_US);
                }
                context->ptrActiveScanSns->currentSenseMethod = mode;
            }
            else
            {
                switchStatus = CY_CAPSENSE_HW_BUSY_E;
            }
        }
        else
        {
            switchStatus = CY_CAPSENSE_HW_LOCKED_E;
        }
    }

    return switchStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetIOsInDesiredState
****************************************************************************//**
*
* Sets all CAPSENSE&trade; pins into a desired state.
*
* Sets all the CSD/CSX IOs into a desired state.
* Default state:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - Strong drive.
* - State   - Zero.
*
* Do not call this function directly from the application program.
*
* \param desiredDriveMode
* Specifies the desired pin control port (PC) configuration.
*
* \param desiredPinOutput
* Specifies the desired pin output data register (DR) state.
*
* \param desiredHsiom
* Specifies the desired pin HSIOM state.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetIOsInDesiredState(
                uint32_t desiredDriveMode,
                uint32_t desiredPinOutput,
                en_hsiom_sel_t desiredHsiom,
                const cy_stc_capsense_context_t * context)
{
    uint32_t loopIndex;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;

