zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateWidget_V2
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in the specified widget
* to the default target value.
*
* This function performs exactly the same tasks as
* Cy_CapSense_CalibrateAllWidgets(), but only for a specified widget.
*
* The function skips disabled and non-working widget and reports
* CY_CAPSENSE_STATUS_INVALID_STATE.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget calibration:
* - CY_CAPSENSE_STATUS_SUCCESS - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_PARAM - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_INVALID_STATE - The specified widget is disabled.
* - CY_CAPSENSE_STATUS_BAD_DATA - The calibration failed and the middleware may not
* operate as expected.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateWidget_V2(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (context->ptrCommonConfig->numWd > widgetId)
    {
        /* Check widget enable status */
        if (0u == Cy_CapSense_IsWidgetEnabled(widgetId, context))
        {
            calibrateStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
        }
        else
        {
            switch (context->ptrWdConfig[widgetId].senseMethod)
            {
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN)
                    case CY_CAPSENSE_CSD_GROUP:
                        calibrateStatus = Cy_CapSense_CSDCalibrateWidget(
                                widgetId, (uint32_t)context->ptrCommonConfig->csdRawTarget, context);
                        break;
                #endif
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)
                    case CY_CAPSENSE_CSX_GROUP:
                        calibrateStatus = Cy_CapSense_CSXCalibrateWidget(
                                widgetId, (uint32_t)context->ptrCommonConfig->csxRawTarget, context);
                        break;
                #endif
                default:
                    /* No action for other methods */
                    break;
            }
        }
    }

    /* Update CRC if BIST is enabled */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
        Cy_CapSense_UpdateCrcWidget(widgetId, context);
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

    return calibrateStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllWidgets_V2
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in all widgets in
* the middleware to default target value.
*
* This function detects the sensing method used by each widget and performs
* a successive approximation search algorithm to find the appropriate modulator
* and compensation IDAC (if enabled) values for all sensors in CSD widgets
* and/or IDAC values for all sensors in CSX widgets to make sensor raw count
* to the default value level.
*
* Calibration returns CY_CAPSENSE_STATUS_BAD_DATA if the resulted raw count is
* outside the limits.
*
* This function could be used only if Enable IDAC auto-calibration parameter
* is enabled for CSD and/or CSX widgets.
*
* The function skips disabled and non-working widgets.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the calibration process:
* - CY_CAPSENSE_STATUS_SUCCESS  - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_DATA - The calibration failed and the middleware may not
*                     operate as expected.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllWidgets_V2(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    cy_capsense_status_t calibrateResult = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t wdgtIndex;

    for (wdgtIndex = 0u; wdgtIndex < context->ptrCommonConfig->numWd; wdgtIndex++)
    {
        /* Check widget enable status */
        if (0u != Cy_CapSense_IsWidgetEnabled(wdgtIndex, context))
        {
            calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;
            calibrateResult |= Cy_CapSense_CalibrateWidget(wdgtIndex, context);
        }
    }

    return (calibrateStatus | calibrateResult);
}
#endif


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllCsdWidgets
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in CSD widgets to
* the default target value.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_CalibrateAllWidgets() function should be used instead.
*
* This function performs exact same tasks of Cy_CapSense_CalibrateAllWidgets(),
* but only for CSD widgets.
*
* The function skips disabled and non-working widgets.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - Zero     - All the widgets are calibrated successfully.
* - Non-zero - Calibration failed for at least one widget.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllCsdWidgets(cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;
    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;

    for (widgetId = 0uL; widgetId < context->ptrCommonConfig->numWd; widgetId++)
    {
        if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            /* Check widget enable status */
            if (0u != Cy_CapSense_IsWidgetEnabled(widgetId, context))
            {
                calibrateStatus |= Cy_CapSense_CSDCalibrateWidget(
                        widgetId, (uint32_t)context->ptrCommonConfig->csdRawTarget, context);
            }
            /* Update CRC if BIST is enabled */
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
                Cy_CapSense_UpdateCrcWidget(widgetId, context);
            #endif
        }
    }

