zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
    return calibrateStatus;
}
#endif


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllCsxWidgets
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in CSX widgets to
* the default target value.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_CalibrateAllWidgets() function should be used instead.
*
* This function performs the exact same tasks of Cy_CapSense_CalibrateAllWidgets(),
* but only for CSX widgets.
*
* The function skips disabled and non-working widgets.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - Zero     - All the widgets are calibrated successfully.
* - Non-zero - Calibration failed for at least one widget.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllCsxWidgets(cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;
    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;

    for (widgetId = 0uL; widgetId < context->ptrCommonConfig->numWd; widgetId++)
    {
        if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            /* Check widget enable status */
            if (0u != Cy_CapSense_IsWidgetEnabled(widgetId, context))
            {
                calibrateStatus |= Cy_CapSense_CSXCalibrateWidget(
                        widgetId, (uint32_t)context->ptrCommonConfig->csxRawTarget, context);
            }
            /* Update CRC if BIST is enabled */
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
                Cy_CapSense_UpdateCrcWidget(widgetId, context);
            #endif
        }
    }

    return calibrateStatus;

}
#endif


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_SsAutoTune
****************************************************************************//**
*
* Performs the parameters auto-tuning for the optimal CAPSENSE&trade; operation when
* smart sensing algorithm is enabled.
*
* This function performs the following tasks:
* - Calibrate Modulator and Compensation IDACs.
* - Tune the Sense Clock optimal value to get a Sense Clock period greater
*   than 2*5*R*Cp.
* - Calculate the resolution for the optimal finger capacitance.
*
* The function skips disabled and non-working widgets.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - Zero     - All the widgets are auto-tuned successfully.
* - Non-zero - Auto-tuning failed for any widget.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SsAutoTune(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t autoTuneStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t wdIndex;

    for (wdIndex = 0u; wdIndex < context->ptrCommonConfig->numWd; wdIndex++)
    {
        if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[wdIndex].senseMethod)
        {
            /* Check widget enable status */
            if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
            {
                autoTuneStatus |= Cy_CapSense_SsAutoTuneWidget(wdIndex, context);
            }
        }
    }

    return autoTuneStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsAutoTuneWidget
****************************************************************************//**
*
* Performs the parameters auto-tuning for the optimal CAPSENSE&trade; operation when
* smart sensing algorithm is enabled.
*
* This function performs the following tasks:
* - Calibrate Modulator and Compensation IDACs.
* - Tune the Sense Clock optimal value to get a Sense Clock period greater
*   than 2*5*R*Cp.
* - Calculate the resolution for the optimal finger capacitance.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - Zero     - All the widgets are auto-tuned successfully.
* - Non-zero - Auto-tuning failed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SsAutoTuneWidget(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t autoTuneStatus = CY_CAPSENSE_STATUS_SUCCESS;

    uint32_t snsIndex;
    uint32_t inputSnsClk;
    uint32_t minSnsClkDiv;
    uint32_t snsClkSourceAuto;

    cy_stc_capsense_auto_tune_config_t autoTuneConfig;

    uint32_t maxRaw = 0u;
    uint32_t maxCp = 0u;
    uint32_t maxIdacComp = 0u;

    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdCfg->ptrWdContext;
    const cy_stc_capsense_sensor_context_t * ptrSnsCtx;

    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
        (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        uint32_t maxCpSnsId = 0u;
    #endif

    /* Store sense clock source to be restored at the end of function */
    snsClkSourceAuto = ptrWdCxt->snsClkSource;

    /* Find input of sensor clock frequency */
    inputSnsClk = context->ptrCommonConfig->periClkHz /
                    context->ptrCommonContext->modCsdClk /
                    CY_CAPSENSE_CSD_AUTOTUNE_CAL_UNITS;

    minSnsClkDiv = context->ptrCommonConfig->periClkHz /
                    context->ptrCommonContext->modCsdClk /
                    CY_CAPSENSE_CSD_SNS_FREQ_KHZ_MAX;
    if (CY_CAPSENSE_MIN_SNS_CLK_DIVIDER > minSnsClkDiv)
    {
        minSnsClkDiv = CY_CAPSENSE_MIN_SNS_CLK_DIVIDER;
    }
    minSnsClkDiv = (minSnsClkDiv + (CY_CAPSENSE_CSD_AUTOTUNE_CAL_UNITS - 1u)) / CY_CAPSENSE_CSD_AUTOTUNE_CAL_UNITS;
    /* Make divider even */
    if (0u != (minSnsClkDiv & 0x01u))
    {
        minSnsClkDiv++;
    }

    /* Initialize auto-tuning configuration structure */
    autoTuneConfig.snsClkInputClock = (uint16_t)inputSnsClk;
    autoTuneConfig.snsClkConstantR = CY_CAPSENSE_SMARTSENSE_CSD_RESISTANCE_CONST;
    autoTuneConfig.vRef = context->ptrInternalContext->csdVrefVoltageMv;
    autoTuneConfig.fingerCap = ptrWdCxt->fingerCap;
    autoTuneConfig.sigPFC = &(ptrWdCxt->sigPFC);

