zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
    /*
    * Autotune phase #1:
    * - performing the first calibration at fixed settings
    * - getting maximum sensor Cp
    * - getting sense clock frequency based on Cp
    */

    ptrWdCxt->resolution = CY_CAPSENSE_AUTOTUNE_CALIBRATION_RESOLUTION;
    ptrWdCxt->maxRawCount = (uint16_t)(0x01uL << CY_CAPSENSE_AUTOTUNE_CALIBRATION_RESOLUTION) - 1u;
    ptrWdCxt->snsClkSource = CY_CAPSENSE_CLK_SOURCE_DIRECT;
    ptrWdCxt->snsClk = (uint16_t)(inputSnsClk / CY_CAPSENSE_AUTOTUNE_CALIBRATION_FREQ_KHZ);
    ptrWdCxt->rowSnsClk = ptrWdCxt->snsClk;

    /* Calibrate CSD widget to the default calibration target */
    (void)Cy_CapSense_CSDCalibrateWidget(widgetId,
                                         (uint32_t)context->ptrCommonConfig->csdRawTarget,
                                         context);

    /* Find raw count and IDAC of a sensor with maximum Cp */
    ptrSnsCtx = ptrWdCfg->ptrSnsContext;

    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
    {
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
            if ((maxIdacComp < ptrSnsCtx->idacComp) ||
                ((maxIdacComp == ptrSnsCtx->idacComp) && (maxRaw < ptrSnsCtx->raw)))
            {
                maxIdacComp = ptrSnsCtx->idacComp;
                maxRaw = ptrSnsCtx->raw;
                #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
                     (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
                    maxCpSnsId = snsIndex;
                #endif
            }
        #else
            if (maxRaw < ptrSnsCtx->raw)
            {
                maxRaw = ptrSnsCtx->raw;
                #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
                     (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
                    maxCpSnsId = snsIndex;
                #endif
            }
        #endif
        ptrSnsCtx++;
    }

    /* Update auto-tuning configuration structure */
    autoTuneConfig.iDacMod = ptrWdCxt->idacMod[CY_CAPSENSE_MFS_CH0_INDEX];
    autoTuneConfig.iDacComp = (uint8_t)maxIdacComp;
    autoTuneConfig.iDacGain = context->ptrCommonConfig->idacGainTable[ptrWdCxt->idacGainIndex].gainValue;
    autoTuneConfig.ptrSenseClk = &ptrWdCxt->snsClk;
    autoTuneConfig.calTarget = (uint16_t)((maxRaw * CY_CAPSENSE_CSD_AUTOTUNE_CAL_UNITS) /
            ((uint32_t)(0x01uL << CY_CAPSENSE_AUTOTUNE_CALIBRATION_RESOLUTION) - 1u));

    /* Find sensor Cp and optimum sense clock value */
    maxCp = Cy_CapSense_TunePrescalers_Lib(&autoTuneConfig);
    autoTuneConfig.sensorCap = maxCp;

    /* Increase sensor clock divider to valid value */
    if (((uint32_t)ptrWdCxt->snsClk) < minSnsClkDiv)
    {
        ptrWdCxt->snsClk = (uint16_t)minSnsClkDiv;
    }
    ptrWdCxt->rowSnsClk = ptrWdCxt->snsClk;

    /* Check tuning results */
    if (CY_CAPSENSE_AUTOTUNE_CP_MAX < maxCp)
    {
        autoTuneStatus = CY_CAPSENSE_STATUS_BAD_DATA;
    }

    /*
    * Autotune phase #2:
    * - repeating calibration with new sense clock frequency
    * - getting resolution
    */

    /* Calibrate CSD widget to the default calibration target with newly defined sense frequency */
    (void)Cy_CapSense_CSDCalibrateWidget(widgetId,
                                         (uint32_t)context->ptrCommonConfig->csdRawTarget,
                                         context);

    autoTuneConfig.iDacGain = context->ptrCommonConfig->idacGainTable[ptrWdCxt->idacGainIndex].gainValue;
    autoTuneConfig.iDacMod = ptrWdCxt->idacMod[CY_CAPSENSE_MFS_CH0_INDEX];

    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
         (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType) ||
            ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType))
        {
            if (maxCpSnsId >= ptrWdCfg->numCols)
            {
                autoTuneConfig.iDacMod = ptrWdCxt->rowIdacMod[CY_CAPSENSE_MFS_CH0_INDEX];
            }
        }
    #endif

    /* Find resolution */
    ptrWdCxt->resolution = Cy_CapSense_TuneSensitivity_Lib(&autoTuneConfig);
    ptrWdCxt->maxRawCount = (uint16_t)(0x01uL << ptrWdCxt->resolution) - 1u;


    /*
    * Autotune phase #3:
    * - selecting a widget clock source if AUTO
    * - repeating calibration with found clock frequency, resolution and clock source
    * - updating sensitivity
    */

    /* Update clock source */
    ptrWdCxt->snsClkSource = (uint8_t)snsClkSourceAuto;
    Cy_CapSense_CSDSetWidgetSenseClkSrc(ptrWdCfg);

    /* Calibrate CSD widget to the default calibration target with newly defined resolution */
    autoTuneStatus |= Cy_CapSense_CSDCalibrateWidget(widgetId,
                                                     (uint32_t)context->ptrCommonConfig->csdRawTarget,
                                                     context);
    /* Update CRC if BIST is enabled */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
        Cy_CapSense_UpdateCrcWidget(widgetId, context);
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

    return autoTuneStatus;
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeSourceSenseClk
****************************************************************************//**
*
* Sets a source for Sense/Tx clock for all widgets.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeSourceSenseClk(const cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = context->ptrWdConfig;

    for (wdIndex = 0u; wdIndex < context->ptrCommonConfig->numWd; wdIndex++)
    {
        switch (ptrWdCfg->senseMethod)
        {
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            case CY_CAPSENSE_CSD_GROUP:
                Cy_CapSense_CSDSetWidgetSenseClkSrc(ptrWdCfg);
                break;
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            case CY_CAPSENSE_CSX_GROUP:
                Cy_CapSense_CSXSetWidgetTxClkSrc(ptrWdCfg);
                break;
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

            default:
                /* No action for other methods */
                break;
        }
        /* Switch to the next widget */
        ptrWdCfg++;
    }
}


