zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_SsCalcLfsrSize
****************************************************************************//**
*
* Finds a SSC polynomial size when clock source is configured to Auto mode.
*
* The SSC polynomial size in the auto mode is found based on the following
* requirements:
* - an LFSR value should be selected so that the max clock dither
*   is limited with +/-10%.
* - at least one full spread spectrum polynomial should pass during
*   the scan time.
* - the value of the number of conversions should be an integer multiple
*   of the repeat period of the programmed LFSR_SIZE.
*
* \param clkDivider
* The divider value for the sense/Tx clock.
*
* \param conversionsNum
* The widget conversion number.
*
* \return
* Returns the size of LFSR value for the SENSE_PERIOD register.
*
*******************************************************************************/
uint32_t Cy_CapSense_SsCalcLfsrSize(uint32_t clkDivider, uint32_t conversionsNum)
{
    uint32_t lfsrSize = 0u;

    if (CY_CAPSENSE_SNSCLK_LFSR_THRESHOLD <= clkDivider)
    {
        /* Find LFSR value */
        if ((CY_CAPSENSE_SNSCLK_SSC4_PERIOD <= conversionsNum) &&
           (0uL == (conversionsNum % CY_CAPSENSE_SNSCLK_SSC4_PERIOD)))
        {
            lfsrSize = CY_CAPSENSE_CLK_SOURCE_SSC10;
        }
        else if ((CY_CAPSENSE_SNSCLK_SSC3_PERIOD <= conversionsNum) &&
                (0uL == (conversionsNum % CY_CAPSENSE_SNSCLK_SSC3_PERIOD)))
        {
            lfsrSize = CY_CAPSENSE_CLK_SOURCE_SSC9;
        }
        else if ((CY_CAPSENSE_SNSCLK_SSC2_PERIOD <= conversionsNum) &&
                (0uL == (conversionsNum % CY_CAPSENSE_SNSCLK_SSC2_PERIOD)))
        {
            lfsrSize = CY_CAPSENSE_CLK_SOURCE_SSC7;
        }
        else if ((CY_CAPSENSE_SNSCLK_SSC1_PERIOD <= conversionsNum) &&
                (0uL == (conversionsNum % CY_CAPSENSE_SNSCLK_SSC1_PERIOD)))
        {
            lfsrSize = CY_CAPSENSE_CLK_SOURCE_SSC6;
        }
        else
        {
            lfsrSize = CY_CAPSENSE_CLK_SOURCE_DIRECT;
        }
    }

    return lfsrSize;
}


/*******************************************************************************
* Function Name: Cy_CapSense_DischargeExtCapacitors
****************************************************************************//**
*
* Discharges available external capacitors.
*
* The function discharges available external capacitors by disconnecting them
* from an analog bus and configuring strong GPIO drive mode with 0.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_DischargeExtCapacitors(cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        uint32_t cmodPcReg = 0uL;
        en_hsiom_sel_t cmodHsiomReg = CY_CAPSENSE_HSIOM_SEL_GPIO;
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        uint32_t cintAPcReg = 0uL;
        uint32_t cintBPcReg = 0uL;
        en_hsiom_sel_t cintAHsiomReg = CY_CAPSENSE_HSIOM_SEL_GPIO;
        en_hsiom_sel_t cintBHsiomReg = CY_CAPSENSE_HSIOM_SEL_GPIO;
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
        uint32_t cshPcReg = 0uL;
        en_hsiom_sel_t cshHsiomReg = CY_CAPSENSE_HSIOM_SEL_GPIO;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        Cy_CapSense_SsReadPinRegisters(context->ptrCommonConfig->portCmod,
            (uint32_t)context->ptrCommonConfig->pinCmod, &cmodPcReg, &cmodHsiomReg);
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCmod,
            (uint32_t)context->ptrCommonConfig->pinCmod, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
        Cy_GPIO_Clr(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod);

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
            Cy_CapSense_SsReadPinRegisters(context->ptrCommonConfig->portCsh,
                (uint32_t)context->ptrCommonConfig->pinCsh, &cshPcReg, &cshHsiomReg);
            Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCsh,
                (uint32_t)context->ptrCommonConfig->pinCsh, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
            Cy_GPIO_Clr(context->ptrCommonConfig->portCsh, (uint32_t)context->ptrCommonConfig->pinCsh);
        #endif
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        Cy_CapSense_SsReadPinRegisters(context->ptrCommonConfig->portCintA,
            (uint32_t)context->ptrCommonConfig->pinCintA, &cintAPcReg, &cintAHsiomReg);
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintA,
            (uint32_t)context->ptrCommonConfig->pinCintA, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
        Cy_GPIO_Clr(context->ptrCommonConfig->portCintA, (uint32_t)context->ptrCommonConfig->pinCintA);

        Cy_CapSense_SsReadPinRegisters(context->ptrCommonConfig->portCintB,
            (uint32_t)context->ptrCommonConfig->pinCintB, &cintBPcReg, &cintBHsiomReg);
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintB,
            (uint32_t)context->ptrCommonConfig->pinCintB, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
        Cy_GPIO_Clr(context->ptrCommonConfig->portCintB, (uint32_t)context->ptrCommonConfig->pinCintB);
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

    Cy_SysLib_DelayUs(CY_CAPSENSE_EXT_CAP_DISCHARGE_TIME);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCmod,
            (uint32_t)context->ptrCommonConfig->pinCmod, cmodPcReg, cmodHsiomReg);

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
            Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCsh,
                (uint32_t)context->ptrCommonConfig->pinCsh, cshPcReg, cshHsiomReg);
        #endif
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintA,
            (uint32_t)context->ptrCommonConfig->pinCintA, cintAPcReg, cintAHsiomReg);

        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintB,
            (uint32_t)context->ptrCommonConfig->pinCintB, cintBPcReg, cintBHsiomReg);
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */
}


