zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_SsReadPinRegisters
****************************************************************************//**
*
* Reads drive mode and HSIOM registers of the specified pin.
*
* \param base
* The pointer to the pin's port register base address.
*
* \param pinNum
* Position of the pin bit-field within the port register.
*
* \param dm
* The pointer to the drive mode variable.
*
* \param hsiom
* The pointer to the HSIOM variable.
*
*
*******************************************************************************/
void Cy_CapSense_SsReadPinRegisters(GPIO_PRT_Type * base, uint32_t pinNum, uint32_t * dm, en_hsiom_sel_t * hsiom)
{
    uint32_t interruptState = Cy_SysLib_EnterCriticalSection();
    *dm = Cy_GPIO_GetDrivemode(base, pinNum);
    *hsiom = Cy_GPIO_GetHSIOM(base, pinNum);
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetClkDivider
****************************************************************************//**
*
* Sets the modulator clock and then starts it.
*
* Do not call this function directly from the application program.
*
* \param dividerValue
* The divider value for the modulator clock.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetClkDivider(
                uint32_t dividerValue,
                const cy_stc_capsense_context_t * context)
{
    uint32_t dividerIndex = (uint32_t)context->ptrCommonConfig->periDividerIndex;

    #if (0u != CY_CAPSENSE_PSOC6_FOURTH_GEN)
        cy_en_divider_types_t dividerType;
    #else
        cy_en_sysclk_divider_types_t dividerType;
    #endif

    switch (context->ptrCommonConfig->periDividerType)
    {
        case (uint8_t)CY_SYSCLK_DIV_8_BIT:
            dividerType = CY_SYSCLK_DIV_8_BIT;
            break;
        case (uint8_t)CY_SYSCLK_DIV_16_BIT:
            dividerType = CY_SYSCLK_DIV_16_BIT;
            break;
        case (uint8_t)CY_SYSCLK_DIV_16_5_BIT:
            dividerType = CY_SYSCLK_DIV_16_5_BIT;
            break;
        default:
            dividerType = CY_SYSCLK_DIV_24_5_BIT;
            break;
    }

    (void)Cy_SysClk_PeriphDisableDivider(dividerType, dividerIndex);

    if ((CY_SYSCLK_DIV_8_BIT == dividerType) || (CY_SYSCLK_DIV_16_BIT == dividerType))
    {
        (void)Cy_SysClk_PeriphSetDivider(dividerType, dividerIndex, dividerValue);
    }
    else
    {
        (void)Cy_SysClk_PeriphSetFracDivider(dividerType, dividerIndex, dividerValue, 0u);
    }
    (void)Cy_SysClk_PeriphEnableDivider(dividerType, dividerIndex);
}


/*******************************************************************************
* Function Name: Cy_CapSense_WatchdogCyclesNum
****************************************************************************//**
*
* Converts the specified time into number of CPU cycles.
*
* \param desiredTimeUs
* The time (delay) specified in us.
*
* \param cpuFreqMHz
* The CPU frequency in MHz.
*
* \param cyclesPerLoop
* The number of cycles per a loop.
*
*******************************************************************************/
uint32_t Cy_CapSense_WatchdogCyclesNum(
                uint32_t desiredTimeUs,
                uint32_t cpuFreqMHz,
                uint32_t cyclesPerLoop)
{
    uint32_t retVal;

    if (0uL != cyclesPerLoop)
    {
        retVal = (desiredTimeUs * cpuFreqMHz) / cyclesPerLoop;
    }
    else
    {
        retVal = 0xFFFFFFFFuL;
    }

    return retVal;
}


/*******************************************************************************
* Function Name: Cy_CapSense_WaitForSeqIdle
****************************************************************************//**
*
* This internal function checks the state of the CSD HW sequencer. If the
* sequencer is switched to the IDLE state before the software timeout,
* the function returns a non-zero. If the software watchdog is triggered
* during the scan, the function returns zero.
*
* \param watchdogCycleNum
* A watchdog cycle number to check a timeout.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watchdog counter. If it is equal to zero, it means timeout happened.
*
*******************************************************************************/
uint32_t Cy_CapSense_WaitForSeqIdle(
         uint32_t watchdogCycleNum,
         const cy_stc_capsense_context_t * context)
{
    uint32_t watchdogCounter = watchdogCycleNum;

    while ((0u != (CY_CAPSENSE_CSD_SEQ_START_START_MSK &
        context->ptrCommonConfig->ptrCsdBase->SEQ_START)))
    {
        if (0uL == watchdogCounter)
        {
            break;
        }

        watchdogCounter--;
    }


    return watchdogCounter;
}


/*******************************************************************************
* Function Name: Cy_CapSense_WaitEndOfScan
****************************************************************************//**
*
* This internal function checks for the scan status. If the scan ends before
* the software watchdog triggering, the function returns a non-zero watchdog
* cycles number. If the software watchdog triggers during the scan,
* the function returns zero.
*
* \param watchdogCycleNum
* A watchdog cycle number to check a timeout.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watchdog counter. If it is equal to zero, it means timeout happened.
*
*******************************************************************************/
uint32_t Cy_CapSense_WaitEndOfScan(
         uint32_t watchdogCycleNum,
         const cy_stc_capsense_context_t * context)
{
    uint32_t watchdogCounter = watchdogCycleNum;

    while (((context->ptrCommonConfig->ptrCsdBase->INTR &
             CY_CAPSENSE_CSD_INTR_SAMPLE_MSK) == 0u) && (0u != watchdogCounter))
    {
        watchdogCounter--;
    }

    return watchdogCounter;
}


