zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.c
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateCheck
****************************************************************************//**
*
* Verifies that the calibrated widget meets the configured conditions.
*
* This function checks whether the raw count of each sensor of the specified widget
* is within the raw count range defined by raw count target and +/- calibration
* error.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* The raw count target in percentage.
*
* \param senseMethod
* The widget sensing method.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateCheck(
                uint32_t widgetId,
                uint32_t target,
                uint32_t senseMethod,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t tmpRawcount;
    uint32_t snsIndex;
    uint32_t upperLimit;
    uint32_t lowerLimit;
    uint8_t calibrationError;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    const cy_stc_capsense_sensor_context_t * ptrChCxt = ptrWdCfg->ptrSnsContext;
    uint32_t freqChIndex;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;

    /* Calculate acceptable raw count range based on the resolution, target and error */
    if (CY_CAPSENSE_CSD_GROUP == senseMethod)
    {
        tmpRawcount = (1uL << context->ptrWdContext[widgetId].resolution) - 1u;
        calibrationError = context->ptrCommonConfig->csdCalibrationError;
    }
    else
    {
        tmpRawcount = context->ptrWdContext[widgetId].maxRawCount;
        calibrationError = context->ptrCommonConfig->csxCalibrationError;
    }

    lowerLimit = 0u;

    if (target > calibrationError)
    {
        lowerLimit = target - calibrationError;
    }
    upperLimit = target + calibrationError;
    if (upperLimit > CY_CAPSENSE_PERCENTAGE_100)
    {
        upperLimit = CY_CAPSENSE_PERCENTAGE_100;
    }
    lowerLimit = (tmpRawcount * lowerLimit) / CY_CAPSENSE_PERCENTAGE_100;
    upperLimit = (tmpRawcount * upperLimit) / CY_CAPSENSE_PERCENTAGE_100;

    /* Check whether sensors' rawcount is in the defined range */
    for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
    {
        ptrSnsCxt = ptrChCxt;
        for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
        {
            tmpRawcount = ptrSnsCxt->raw;
            if ((tmpRawcount < lowerLimit) || (tmpRawcount > upperLimit))
            {
                calibrateStatus = CY_CAPSENSE_STATUS_BAD_DATA;
                break;
            }
            ptrSnsCxt++;
        }
        ptrChCxt += context->ptrCommonConfig->numSns;
    }

    return calibrateStatus;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) ||\
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)) */


/*******************************************************************************
* Function Name: Cy_CapSense_GetVrefAutoMv
****************************************************************************//**
*
* Finds the optimal Vref value based on the VDDA voltage.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the recommended reference voltage based on the configuration.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetVrefAutoMv(const cy_stc_capsense_context_t * context)
{
    uint32_t vddaMv = (uint32_t)context->ptrCommonConfig->vdda;
    uint32_t vrefHighVoltageMv;

    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        if (vddaMv >= CY_CAPSENSE_VREF_RANGE_0)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_0;
        }
        else if (vddaMv >= CY_CAPSENSE_VREF_RANGE_1)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_1;
        }
        else if (vddaMv >= CY_CAPSENSE_VREF_RANGE_2)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_2;
        }
        else
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_MIN;
        }
    #else
        if (vddaMv >= CY_CAPSENSE_VREF_RANGE_0)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_0;
        }
        else if (vddaMv >= CY_CAPSENSE_VREF_RANGE_1)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_1;
        }
        else
        {
            if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
            {
                vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_MIN_PASS;
            }
            else
            {
                vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_MIN_SRSS;
            }
        }
    #endif

    return vrefHighVoltageMv;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetVrefHighGain
****************************************************************************//**
*
* Calculates the VrefHigh Gain, based on the values of the device VDDA voltage,
* the Vref source voltage, and the desired VrefHigh voltage.
*
* \param vrefDesiredMv
* Desired VrefHigh voltage.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the lowest Gain code required to produce the VrefHigh voltage,
* when the VrefHigh is close to the desired voltage (passed through the
* vrefDesiredMv parameter) but not greater than the desired voltage.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetVrefHighGain(uint32_t vrefDesiredMv, const cy_stc_capsense_context_t * context)
{
    uint32_t vferhiGain;
    uint32_t vrefInputMv;

    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        (void)context;
        vrefInputMv = CY_CAPSENSE_VREF_SRSS_MV;
    #else
        if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
        {
            vrefInputMv = CY_CAPSENSE_VREF_PASS_MV;
        }
        else
        {
            vrefInputMv = CY_CAPSENSE_VREF_SRSS_MV;
        }
    #endif

    vferhiGain = ((CY_CAPSENSE_VREF_GAIN_MAX * vrefInputMv) - 1u) / (vrefDesiredMv + 1u);

    if (vferhiGain > ((uint32_t)CY_CAPSENSE_VREF_GAIN_MAX - 1u))
    {
        vferhiGain = (uint32_t)CY_CAPSENSE_VREF_GAIN_MAX - 1u;
    }

    return vferhiGain;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetVrefHighMv
****************************************************************************//**
*
* Calculates the VrefHigh voltage, based on the Gain code and the Vref source
* voltage.
*
* \param vrefGain
* The Gain code.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the VrefHigh voltage in mV, to be produced for the specified vref Gain
* code and Vref source voltage.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetVrefHighMv(uint32_t vrefGain, const cy_stc_capsense_context_t * context)
{
    uint32_t vrefHighMv;
    uint32_t vrefInputMv;

    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        (void)context;
        vrefInputMv = CY_CAPSENSE_VREF_SRSS_MV;
    #else
        if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
        {
            vrefInputMv = CY_CAPSENSE_VREF_PASS_MV;
        }
        else
        {
            vrefInputMv = CY_CAPSENSE_VREF_SRSS_MV;
        }
    #endif

    vrefHighMv = (CY_CAPSENSE_VREF_GAIN_MAX * vrefInputMv) / (vrefGain + 1u);

    return vrefHighMv;
}

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2)) */


/* [] END OF FILE */
